app/views/static_pages/home.html.erb

	        <div class="card-action">
	          <%= link_to "click here", submission_path(submission) %>  <%= "Score: #{Vote.where(:submission_id => submission.id).sum(:upvote)}" %>
---
SELECT SUM("votes"."upvote") FROM "votes" WHERE "votes"."submission_id" = $1  [["submission_id", 495]]