app/views/users/index.html.erb

SELECT "users".* FROM "users"
---
  <% @users.each do |user| %>
  <li><%= link_to(user.username.split.map(&:capitalize).join(' '), user_path(user)) %></li>