app/views/users/show.html.erb

SELECT  1 AS one FROM "submissions" WHERE "submissions"."user_id" = $1 LIMIT $2  [["user_id", 24], ["LIMIT", 1]]
SELECT "submissions".* FROM "submissions" WHERE "submissions"."user_id" = $1  [["user_id", 24]]
---
<br><h4>SUBMISSIONS</h4>
  <% if @user.submissions.empty? %>

SELECT SUM("votes"."upvote") FROM "votes" WHERE "votes"."submission_id" = $1  [["submission_id", 72]]
---
    	        <div class="card-action">
    	          <%= link_to "click here", submission_path(submission) %>  <%= "Score: #{Vote.where(:submission_id => submission.id).sum(:upvote)}" %>

SELECT  1 AS one FROM "comments" WHERE "comments"."user_id" = $1 LIMIT $2  [["user_id", 24], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = $1  [["user_id", 24]]
---
<br><h4>COMMENTS</h4>
<% if @user.comments.empty? %>