app/views/submissions/show.html.erb


<% if @submission.comments.blank? && current_user %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."submission_id" = $1  [["submission_id", 463]]