app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(comment_params)
    @comment.user_id = session[:user_id]
    if @comment.save
---
INSERT INTO "comments" ("body", "user_id", "submission_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "DOOT DOOT!"], ["user_id", 22], ["submission_id", 463], ["created_at", 2017-04-21 23:03:40 UTC], ["updated_at", 2017-04-21 23:03:40 UTC]]