app/controllers/static_pages_controller.rb

SELECT "submissions".* FROM "submissions"
SELECT SUM("votes"."upvote") FROM "votes" WHERE "votes"."submission_id" = $1  [["submission_id", 460]]
SELECT  "submissions".* FROM "submissions" WHERE "submissions"."id" = $1 LIMIT $2  [["id", 463], ["LIMIT", 1]]
---
  def home
    @submissions = Submission.all.each_with_object({}) do |submission, new_hash|
			new_hash[submission.id] = Vote.where(:submission_id => submission.id).sum(:upvote)
		end.sort_by {|key, value| value}.reverse.to_h.keys.map {|key| Submission.find(key)}