app/controllers/submissions_controller.rb

SELECT "submissions".* FROM "submissions"
SELECT SUM("votes"."upvote") FROM "votes" WHERE "votes"."submission_id" = $1  [["submission_id", 460]]
SELECT  "submissions".* FROM "submissions" WHERE "submissions"."id" = $1 LIMIT $2  [["id", 463], ["LIMIT", 1]]
---
	def index
		@submissions = Submission.all.each_with_object({}) do |submission, new_hash|
			new_hash[submission.id] = Vote.where(:submission_id => submission.id).sum(:upvote)
		end.sort_by {|key, value| value}.reverse.to_h.keys.map {|key| Submission.find(key)}

SELECT  "submissions".* FROM "submissions" WHERE "submissions"."id" = $1 LIMIT $2  [["id", 460], ["LIMIT", 1]]
SELECT SUM("votes"."upvote") FROM "votes" WHERE "votes"."submission_id" = $1  [["submission_id", 460]]
---
	def show
		@submission = Submission.find(params[:id])
		@comment = Comment.new
		@votes = Vote.where(:submission_id => @submission.id).sum(:upvote)

INSERT INTO "submissions" ("title", "url", "description", "created_at", "updated_at", "image", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
	def create
		page = MetaInspector.new(submission_params[:url])
		img = page.images.best
		@submission = Submission.new(
			image: img,
			title: page.meta_tag["property"]["og:title"],
			description: page.meta_tag["property"]["og:description"],
			user_id: session[:user_id]
			)
		if @submission.save

SELECT  "submissions".* FROM "submissions" WHERE "submissions"."id" = $1 LIMIT $2  [["id", 74], ["LIMIT", 1]]
---
	def edit
		@submission = Submission.find(params[:id])

SELECT  "submissions".* FROM "submissions" WHERE "submissions"."id" = $1 LIMIT $2  [["id", 74], ["LIMIT", 1]]
UPDATE "submissions" SET "url" = $1, "updated_at" = $2 WHERE "submissions"."id" = $3  [["url", ""], ["updated_at", 2017-04-23 19:31:14 UTC], ["id", 74]]
---
	def update
		@submission = Submission.find(params[:id])
		if @submission.update(submission_params)

DELETE FROM "submissions" WHERE "submissions"."id" = $1  [["id", 79]]
SELECT  "submissions".* FROM "submissions" WHERE "submissions"."id" = $1 LIMIT $2  [["id", 79], ["LIMIT", 1]]
---
	def destroy
		Submission.find(params[:id]).destroy