app/controllers/users_controller.rb

  def create
    user = User.new(user_params)
    if user.save
---
INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "Robbie"], ["password_digest", "$2a$10$DbHpzSv0gaTb/bBhjP7Ik.7CWnjELvqDnQLvV/FD9gkN2mpD8S6Xa"], ["created_at", 2017-04-22 00:34:04 UTC], ["updated_at", 2017-04-22 00:34:04 UTC]]

  def update
    if @user.update(user_params)
---
UPDATE "users" SET "username" = $1, "password_digest" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["username", "Tim"], ["password_digest", "$2a$10$e1BEQ0NfK9G6ecjjIz2pKOwuMkZASHuC/iEQ3M0.ZAxMwpkdq1btm"], ["updated_at", 2017-04-18 21:44:42 UTC], ["id", 5]]