app/controllers/votes_controller.rb

  def user_vote
    submission_id = params[:id].split("_").first
    vote_value = params[:id].split("_").last
    vote = Vote.find_by(:user_id => session[:user_id], :submission_id => submission_id)

    if vote.nil?
      vote = Vote.create(:user_id => session[:user_id], :submission_id => submission_id, :upvote => vote_value)
      flash[:notice] = "Successfully voted...'murica'"
      redirect_to submission_path(submission_id)
    elsif vote.upvote.to_i == vote_value.to_i
      flash[:notice] = "You already voted for this article"
      redirect_to submission_path(submission_id)
    else
      vote.update(upvote: vote_value)
---
SELECT  "votes".* FROM "votes" WHERE "votes"."user_id" = $1 AND "votes"."submission_id" = $2 LIMIT $3  [["user_id", 22], ["submission_id", 463], ["LIMIT", 1]]
INSERT INTO "votes" ("user_id", "submission_id", "upvote", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 22], ["submission_id", 462], ["upvote", 1], ["created_at", 2017-04-21 23:18:21 UTC], ["updated_at", 2017-04-21 23:18:21 UTC]]
UPDATE "votes" SET "upvote" = $1, "updated_at" = $2 WHERE "votes"."id" = $3  [["upvote", -1], ["updated_at", 2017-04-21 23:08:57 UTC], ["id", 10]]